[
  {
    "id": "fix-navigationmenu-issues",
    "description": "TASK: Fix multiple NavigationMenu rendering issues in SDUI mode. ISSUE 1 - Hover Styling: On hover, shows white text on grey background making text unreadable, dropdown is all white (https://i.imgur.com/eHkc352.png). ISSUE 2 - Missing Badge: 'With Icons And Badges' story doesn't show badges in SDUI. ISSUE 3 - Alignment: 'With Full Width Content' story is left-aligned in SDUI but should be horizontally centered like React. ISSUE 4 - Missing Elements: 'With Branding And CTA' story missing branding text '**ACME' and CTA buttons in SDUI. ACTION REQUIRED: 1) Fix hover state styling - ensure readable contrast and proper dropdown styling. 2) Implement badge rendering within navigation items. 3) Fix alignment issues - ensure center alignment matches React. 4) Ensure all navigation elements render: branding, buttons, badges, icons. IMPORTANT: Icons must be actual SVG components, NOT emojis. 5) Test responsive behavior and all navigation patterns. EXPECTED OUTCOME: NavigationMenu in SDUI should match React exactly for styling, alignment, and all child elements including proper SVG icons.",
    "status": "pending"
  },
  {
    "id": "fix-resizable-sdui",
    "description": "TASK: Fix Resizable component styling and icon issues in SDUI mode. ISSUE 1 - Text Color: IDE Layout story shows black text in SDUI (https://i.imgur.com/Eh2WkRq.png) but white text in React (https://i.imgur.com/4CVhL4H.png). This breaks the IDE theme appearance. ISSUE 2 - Missing Icons: Icons don't render at all in SDUI mode for resizable panels. IMPORTANT: Emojis are NOT valid icons - SDUI must render actual icon components (SVGs) just like React mode. ACTION REQUIRED: 1) Fix text color inheritance - ensure dark theme styles apply in SDUI. 2) Implement actual SVG icon rendering for resize handles and panel content. 3) Ensure resize functionality works identically in both modes. 4) Test with nested resizable panels and different orientations. 5) Verify drag handles and cursors work properly. EXPECTED OUTCOME: Resizable panels in SDUI should match React appearance and functionality exactly with proper SVG icons.",
    "status": "pending"
  },
  {
    "id": "fix-table-styling-sdui",
    "description": "TASK: Fix Table component styling inconsistencies in SDUI mode. ISSUE 1 - Striped: 'Striped' variant doesn't show alternating row colors in SDUI. ISSUE 2 - Bordered: Missing borders and incorrect header background in SDUI. ISSUE 3 - Spacing: 'Minimal' and 'Compact' variants have too much spacing in SDUI (React spacing is correct). ISSUE 4 - Modern Style: 'Modern' variant looks completely different in SDUI vs React. ISSUE 5 - Hover Effect: 'No Hover Effect' variant shows hover effects in SDUI but shouldn't (React is correct). ACTION REQUIRED: 1) Ensure stripe styles are applied in SDUI mode. 2) Fix border and header background styles. 3) Correct spacing for compact variants. 4) Match modern variant styling to React. 5) Remove hover effects where not intended. 6) Test all table variants thoroughly. EXPECTED OUTCOME: All table styling variants in SDUI should match React exactly.",
    "status": "pending"
  },
  {
    "id": "implement-form-validation-sdui",
    "description": "TASK: Implement comprehensive form validation system for SDUI mode. CRITICAL ISSUE: Form 'With Validation' story - submit button does nothing in SDUI mode. Form validation is completely non-functional. SEVERITY: Critical - form validation is essential for any application. SCOPE: This requires building validation infrastructure for SDUI from scratch. ACTION REQUIRED: 1) Design validation system architecture for SDUI mode. 2) Implement field-level validation with error messages. 3) Support common validators: required, email, min/max length, patterns. 4) Implement form-level validation and submit handling. 5) Show validation errors inline with fields. 6) Create comprehensive documentation in Storybook showing validation patterns. 7) Support async validation and custom validators. EXPECTED OUTCOME: Full-featured form validation system in SDUI with extensive documentation and examples.",
    "status": "pending"
  }
]