[
  {
    "id": "component-fixes-storybook",
    "description": "Theres quite a few components that need a bit of polish, either just the component itself or storybook. You can take multiple of these subtasks simultaneously to help speed up development. For all subtasks, where appropriate, make sure stories are updated, and relevant pages in the showcase examples app (./examples).  Feel free to pick multiple sub tasks at the same time to speed up development.",
    "status": "pending",
    "subtasks": [
      {
        "id": "togglegroup",
        "description": "The ToggleGroup component default story goes black bg when hover - this looks awful, it should be a lot more subtle (very light grey for example). Textarea, input fields etc. have the WORST grey background on hover - they either shouldn't have any hover background, or should be VERY subtle (i.e. if main bg is white, should hover to bg-gray-50 or something (or whatever that equivalent is). This impacts Textarea, Input, Select. Like honestly, its the worst thing I've ever seen.",
        "status": "completed"
      },
      {
        "id": "accordion",
        "description": "The Accordion component items go dark grey bg when hover - this looks awful, it should be a lot more subtle (very light grey for example). Also, text kind of jumps - i guessing there is no padding, and then when you hover there is padding, causing text to jump. Honestly, you are so far from the mark on this component. Redo all of the UI to make it way sexier, way more 🔥 (while still being really clean). Use framer motion/animations/transition etc. to make it all really, really nice.",
        "status": "completed"
      },
      {
        "id": "switch-animate",
        "description": "Can you animate the transition of the Switch component. Make it optional as a prop (default to animate, but have a prop to disable animation). Update the storybook page.",
        "status": "completed"
      },
      {
        "id": "select-flicker",
        "description": "When I click the Select box and the dropdown comes down, the main Select box 'flickers'. It goes invisible, visible, moves, etc. Please take a look and make sure it doesnt flicker or whatever and is very clean and functional. This also affects the ComboBox component.",
        "status": "pending"
      },
      {
        "id": "radiogroup",
        "description": "The RadioGroup options should have cursor-pointer on hover. ALso, when I hover over a RadioGroup option, the 'circle' element disappears for some reason. Both of these issues also impact the CheckBox component.",
        "status": "pending"
      },
      {
        "id": "masonry",
        "description": "The Masonry component has a 'Pinterest Gallery' story/variant. When you hover over, the image kind of zooms, text appears, etc. It just 'appears' and looks weird - this should all transition in smoothly with framer motion.",
        "status": "pending"
      },
      {
        "id": "grid-stories",
        "description": "Why, in the Grid component storybooks, are most of the boxes fading in and out? Remove this",
        "status": "pending"
      },
      {
        "id": "form-stories",
        "description": "The Form component storybook has a With Initial Errors story. I dont actually see any errors in this variant/state. Can you investigate and confirm whether its a storybook issue or component issue. If component issue, fix it.",
        "status": "pending"
      },
      {
        "id": "placeholder-images",
        "description": "The following component stories contain images that 404. Can you update with images from Picsum (if photo) or placehold.co (if not photo). You can see examples from other component storybooks: Box ('Box With Backdrop Blur')",
        "status": "pending"
      },
      {
        "id": "tooltip-flicker",
        "description": "When I first load the Tooltip stories, all of the buttons (Hover me) 'flicker' - theyre visible, then go invisible and back to visible. Please fix. Also - when I hover, I dont see the tooltip. This component seems REALLY buggy, please investigate and fix.",
        "status": "pending"
      },
      {
        "id": "dropdown-menu-flicker",
        "description": "When I first load the DropdownMenu stories, all of the buttons (Open Menu) 'flicker' - theyre visible, then go invisible and back to visible. Please fix.",
        "status": "pending"
      },
      {
        "id": "drawer-menu-flicker",
        "description": "When I first load the Drawer stories, all of the buttons (Open Drawer) 'flicker' - theyre visible, then go invisible and back to visible. Please fix.",
        "status": "pending"
      },
      {
        "id": "dialog-menu-flicker",
        "description": "When I first load the Dialog stories, all of the buttons (Open Dialog) 'flicker' - theyre visible, then go invisible and back to visible. Please fix.",
        "status": "pending"
      },
      {
        "id": "alertdialog-flicker",
        "description": "When I first load the AlertDialog stories, all of the buttons (Show Dialog) 'flicker' - theyre visible, then go invisible and back to visible. Please fix.",
        "status": "pending"
      },
      {
        "id": "datepicker-flicker",
        "description": "When I first load the Dialog stories, all of the buttons (Pick a date) 'flicker' - theyre visible, then go invisible and back to visible. Please fix.",
        "status": "pending"
      },
      {
        "id": "collapsible-flicker",
        "description": "When I first load the Collapsible stories, all of the buttons (Toggle Content) 'flicker' - theyre visible, then go invisible and back to visible. Please fix. Theres also a weird flicker effect when content appears and disappears",
        "status": "pending"
      },
      {
        "id": "toast-background-zindex",
        "description": "Im not sure whaats going on with the Toast component, but when I click the buttons on storybook, the toasts show up, but they either have no bg, or z-index is messed up or something, as the button is over it or visible or something. Please invvestigate and fix.",
        "status": "pending"
      },
      {
        "id": "tabs-animate",
        "description": "Can you update the tabs component to 'animate' between tab transitions (both the tabs and the content). Add a prop to disable this, but enable by default (make sure to update storybook). Can you also update the UI of tabs component to make it look a lot more modern and nicer visually? (while still being really clean, simple and sexy)",
        "status": "pending"
      },
      {
        "id": "table-ui",
        "description": "The UI of the table component absolutely blows. Can you completely update the UI of the Table component to make it look way nicer, sexier (while still being really clean and modern). Feel free to add multiple style variants. Make sure to update storybook with all variants and the showcase page in the example app (./examples).",
        "status": "pending"
      },
      {
        "id": "docs",
        "description": "The following component storybooks dont have a 'Docs' story (all of them should): SkeletonLoader, Loading",
        "status": "pending"
      },
      {
        "id": "sidebar-blocks",
        "description": "We define basic components like buttons as Components and more advanced components (like TeamGrid) as Blocks. Currently, Sidebar is in the components dir and classified as a component. Can you move this code to the blocks dir, update the storybook to be in the Blocks category, and move it from the Components showcase (in example app ./examples) to the blocks components showcase in the example app?",
        "status": "pending"
      },
      {
        "id": "sheet-flicker",
        "description": "When I first load the Sheet stories, all of the buttons (Open Sheet) 'flicker' - theyre visible, then go invisible and back to visible. Please fix. Also - the sheet should animate/transition out (framer motion?) rather than just 'appear'. It looks awful. Also - the Sheet title/subtitle? is padded (good), but the sheet content isnt (bad). Please fix. ",
        "status": "pending"
      },
      {
        "id": "progress-stories-not-visible",
        "description": "I can't see some of the Progress stories - not sure why. Please investigate and fix: Default, Empty, Quarter, Half, Three Quarters, Complete. I can see all of the rest",
        "status": "pending"
      },
      {
        "id": "popover-flutter",
        "description": "When I click the buttons on the Popover storybook page, the button flickers into and out of existence (and kind of moves). Not sure why - fix.",
        "status": "pending"
      },
      {
        "id": "navigation-menu-height",
        "description": "Increase the height of all of the NavigationMenu storybook containers (manually set them to 600px or something). I cant see the dropdown menues. Also, when you hover over a menu item in the NavigationMenu, I DONT want it to be underlined. Also - when an item has a dropdown, there is again that really fucking annoying flicker where it goes visible and then not visible, and the fucking text is WHITE ON A GREY BACKGROUND - CANT READ IT. This component needs to be restyled to be a lot sexier, cleaner, more modern and brandable.",
        "status": "pending"
      },
      {
        "id": "remove-menubar",
        "description": "I don't know what this MenuBar component is, but it sucks. Remove it, stories, remove it from the examples app, component map, docs, etc. Get rid of it.",
        "status": "pending"
      },
      {
        "id": "markdown-code",
        "description": "The Markdown component looks REALLY nice. FOr some reason though, there is a 'grey' border or somerthing around the code example? The code examples look sick, not sure why there is that gray border around them.",
        "status": "pending"
      },
      {
        "id": "keyboard-navigation-hover",
        "description": "I don't know whats going on, but when I hover over the KeyboardNavigationMenu component the background color goes black for some ridiculous reason.",
        "status": "pending"
      },
      {
        "id": "image-zoom",
        "description": "In the Gallery story of the Image component, when I hover over the image there is some sort of zoom effect. It should animate/transition in with something like framer rather than be instant.",
        "status": "pending"
      },
      {
        "id": "card-image-zoom",
        "description": "The Card component has a 'With Zoom Image' story/variant. The zoom should animate/transition in with something like framer, and be a bit slower",
        "status": "pending"
      },
      {
        "id": "hero",
        "description": "The Hero component block default stories have this really weird effect on the main title where it kind fades from right to left or something - get rid of it. It looks awful. Otherwise, looks good.",
        "status": "pending"
      },
      {
        "id": "statblock-ui",
        "description": "Can you redo all of the ui/styles for the StatBlock component? Its way too basic - just text on plain background. Make it more visual, modern, beautiful (but still simple and clean). Maybe add more variants. Update storybook and showcase examples app.",
        "status": "pending"
      },
      {
        "id": "restaurant-menu-block",
        "description": "The RestaurantMenuBlock component - the default story has categories/filters or something - this isn't centered horizontally (it should) - the container should be 100% width of the parent, and all of the buttons/filters centered horizontally. At the moment it doesn't align with the title/subtitle/search. Also - quite a few images on this page 404. Can you use photos from picsum (see examples in other storybooks).",
        "status": "pending"
      },
      {
        "id": "product-showcase-flickering",
        "description": "The ProductShowcase component has a lot of really strange flickering going on. Can you investigate and fix. Quite a few images on this page 404 (storybooks) - can you make sure theyre using images from picsum.",
        "status": "pending"
      },
      {
        "id": "process-steps-line",
        "description": "The line on the ProcessSteps component block don't go all the way (both horizontally and vertically). Please fix - also the UI looks quite.. bleh. Old, dates. Please make it a lot sexier (still clean and simple though).",
        "status": "pending"
      },
      {
        "id": "portfolio-case-studies-zoom",
        "description": "Can you make sure when I hover over a card on the PortfolioCaseStudies component, the image that 'zooms' transitions/animates in with something like framer motion? Can you also slow it down so its quite noticable. Can you make sure the button on this component (View Case Study) has cursor pointer, as do buttons for pagination (on hover etc.). If this is an issue on the Button component - update it there",
        "status": "pending"
      },
      {
        "id": "photo-gallery-image-zoom",
        "description": "Can you make sure when I hover over an image in the PhotoGallery component, the image that 'zooms' transitions/animates in with something like framer motion? Can you also slow it down so its quite noticable. Also - not sure whats going on, but half the tag isnt visible (its overflowing outside of the container)",
        "status": "pending"
      },
      {
        "id": "photo-flip-card",
        "description": "When you flip the photo flip card, it flips and there is a white background/shadow while its flipping. This kind of ruins the flip effect. Please somehow fix, or use transparent background/no shadow on the container. Some of the images on the storybooks page for this component 404 - please use Picsum (see other component stories for examples).",
        "status": "pending"
      },
      {
        "id": "page-hero-header",
        "description": "Love this component/block. Can you add another option to configure an 'overlay'? Use case: 'Fullscreen With Background Image' - I would like an overlay (either black or white, default black) where I can control the opacity (default it) to make the text more legible over the image. Make this configurable, update stories and showcase examples page (./examples)",
        "status": "pending"
      },
      {
        "id": "maps",
        "description": "I can't see any maps in some of the stories for the Map component (Default, Flat Style, Street Style, Satellite Style, Minimal, With Custom Styling, Single Location Minimal, Event Venue). Theres more actually - please investigate and fix. Also, when scrolling using my mousewheel, and I scroll over a map, it stops and starts zooming in/out the map. I think you can disable this behaviour with leaflet - please do. Also - is it possible to remove the Leaflet/carto copyright? If so, can you do it.",
        "status": "pending"
      },
      {
        "id": "latest-news-image-zoom",
        "description": "Can you make sure when I hover over an image in the Latest News component, the image that 'zooms' transitions/animates in with something like framer motion? Can you also slow it down so its quite noticable.",
        "status": "pending"
      },
      {
        "id": "header",
        "description": "Some images in Header block component stories 404 - can you use placehold.co (see other storybooks for examples). ALso - menu is awful. Hovering over a menu item with dropdown flickers it, its white text on a light gray background, the text is underlined (it shuoldnt be). The buttons on the right should also have cursor-pointer. If these are issues in reusable components, please ensure theyre fixed in the reusable components",
        "status": "pending"
      },
      {
        "id": "faq",
        "description": "Can you make sure any element in the FAQ component that is clickable has cursor-pointer (next prev buttons, + symbol etc.). On the carousel variant, there is a really weird pink/red dot or something bottom left (is it meant to be a tag or something, because barely any of it is visible - it overflows outside of the container with hidden overflow)",
        "status": "pending"
      },
      {
        "id": "event-listings",
        "description": "A lot of the images in the EventListings storybook 404 - update all to use picsum",
        "status": "pending"
      },
      {
        "id": "error-page-sexier",
        "description": "Can you make the ErrorPage component look way sexier, and make different variations for different styles of websites (blog, ecommerce platform, magazine, restaurant, etc.)",
        "status": "pending"
      },
      {
        "id": "carousel",
        "description": "I can't see any images in some of the Carousel component stories. Not sure what the issue is, please investigate. Also please update all iamges to use picsum (see examples elsewhere)",
        "status": "pending"
      },
      {
        "id": "call-to-action",
        "description": "Make sure the buttons are centered horizontally in the CallToAction component (the cta buttons Start Free Trial watch demo). The container needs to be 100% width and buttons centered within it.",
        "status": "pending"
      },
      {
        "id": "blog-post-detail",
        "description": "Update the BlogPostDetail component to render markdown (and use our Markdown component we have already built internally). Update storybook and showcase example app (./examples)",
        "status": "pending"
      }
    ]
  }
]
