[
  {
    "id": "dual-mode-portfolio-case-studies",
    "description": "Implement dual-mode story functionality for PortfolioCaseStudies component. CRITICAL: The args MUST use type 'PortfolioCaseStudies' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (case study cards, titles, images, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-pricing-table",
    "description": "Implement dual-mode story functionality for PricingTable component. CRITICAL: The args MUST use type 'PricingTable' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (pricing tiers, features, prices, CTA buttons, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-process-steps",
    "description": "Implement dual-mode story functionality for ProcessSteps component. CRITICAL: The args MUST use type 'ProcessSteps' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (step numbers, titles, descriptions, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-product-showcase",
    "description": "Implement dual-mode story functionality for ProductShowcase component. CRITICAL: The args MUST use type 'ProductShowcase' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (product images, features, descriptions, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-restaurant-menu",
    "description": "Implement dual-mode story functionality for RestaurantMenu component. CRITICAL: The args MUST use type 'RestaurantMenu' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (menu sections, items, prices, descriptions, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-service-list",
    "description": "Implement dual-mode story functionality for ServiceList component. CRITICAL: The args MUST use type 'ServiceList' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (service items, icons, descriptions, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-sidebar",
    "description": "Implement dual-mode story functionality for Sidebar component. CRITICAL: The args MUST use type 'Sidebar' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (sidebar content, navigation items, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-social-share-bar",
    "description": "Implement dual-mode story functionality for SocialShareBar component. CRITICAL: The args MUST use type 'SocialShareBar' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (share buttons, icons, links, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-stat-block",
    "description": "Implement dual-mode story functionality for StatBlock component. CRITICAL: The args MUST use type 'StatBlock' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (stat values, labels, icons, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-team-grid",
    "description": "Implement dual-mode story functionality for TeamGrid component. CRITICAL: The args MUST use type 'TeamGrid' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (team member cards, names, roles, images, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-testimonial",
    "description": "Implement dual-mode story functionality for Testimonial component. CRITICAL: The args MUST use type 'Testimonial' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (quote text, author, role, avatar, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-timeline",
    "description": "Implement dual-mode story functionality for Timeline component. CRITICAL: The args MUST use type 'Timeline' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (timeline items, dates, descriptions, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  },
  {
    "id": "dual-mode-typewriter-text",
    "description": "Implement dual-mode story functionality for TypewriterText component. CRITICAL: The args MUST use type 'TypewriterText' NOT 'component'. The SDUI view should render EXACTLY the same as the React view. Add play() functions that verify actual content renders (animated text, cursor, etc). Test by viewing both React and SDUI tabs in Storybook - they should be identical.",
    "status": "pending"
  }
]