[
  {
    "id": "blocks",
    "description": "We have a great foundation of core library components (i.e. button etc.) however I want to introduce new, more advanced components (we call 'blocks'). These more advanced components should allow users to create fully functioning websites. All 'advanced' components should be in ./src/components/blocks, should be added to the component map, should have storybook files, should be added to the example site (create an 'Component Blocks' link under the 'Components' link in the header, and make sure each 'advanced' component/block has its own dedicated page, as well as being added to a new /showcase/blocks page).",
    "status": "pending",
    "subtasks": [
      {
        "id": "blocks-showcase-page",
        "description": "Create a new /showcase/blocks page in the example app (./examples). Add 'Component Blocks' link to the navigation menu under the existing 'Components' dropdown. The blocks showcase page should display all the advanced block components in an organized grid or list format with links to individual block demo pages. Include a hero section explaining what blocks are (pre-built, advanced components for quickly building websites). Style it consistently with the existing showcase pages.",
        "status": "completed"
      },
      {
        "id": "header-block",
        "description": "Create a 'header' block - this is meant to be the header (with logo, navigation, light/dark mode toggle, fixed/floating) etc. that is at the top of all pages. There should be quite a few different variants and options (i.e. logo might be an image, text, etc. they might not want light/dark mode toggle, might not want it floating/sticky, might want buttons on right to login, signup etc. etc.) - it should be really flexible, while still looking really nice, clean and modern. Internally it should use existing components (i.e. menu, nav, button etc.). Should be mobile responsive",
        "status": "completed"
      },
      {
        "id": "page-header",
        "description": "Create a new 'page-hero-header' component. This is the component that should be the 'main' hero on a page (i.e. think marketing website). It should have many different props and variants to be really flexible and to suit many different types of websites (i.e. title, description, options for ctas, options for fullscreen image, option for right aligned image only, etc.  etc.). Just image its a flexible component for most different types of websites. It should look really sexy, real clean, simple, modern.",
        "status": "completed"
      },
      {
        "id": "footer-block",
        "description": "Move the existing footer component to the new blocks directory (src/components/blocks/footer). Remove it from the showcase page in the example app and add it to the new blocks showcase page. Enhance it with: multiple column layouts (2-6 columns), social icon integration (install react-icons library), newsletter signup section, company info section, legal links row, and multiple variants (minimal, standard, expanded). Make it fully responsive with mobile-first design. Create comprehensive Storybook stories showing all variants.",
        "status": "completed"
      },
      {
        "id": "feature-card-block",
        "description": "Move the existing FeatureCard component to blocks directory. Create multiple variants: icon-top, icon-left, icon-background, card-hover-effects, with/without CTA buttons. Add support for: custom icons (via react-icons), gradient backgrounds, border variants, shadow options, and animation on scroll. Create grid layout options (2x2, 3x1, 3x2) in Storybook. Add to blocks showcase with interactive examples.",
        "status": "completed"
      },
      {
        "id": "pricing-table-block",
        "description": "Move existing PricingTable to blocks directory. Enhance with: monthly/yearly toggle, feature comparison matrix, recommended tier highlighting, custom badge support, tiered pricing (starter/pro/enterprise), and currency formatting. Create variants: cards layout, comparison table, minimal cards, with testimonials. Add hover states, smooth transitions, and mobile-optimized views. Include 'Contact Sales' option for enterprise.",
        "status": "completed"
      },
      {
        "id": "call-to-action-block",
        "description": "Move CallToAction component to blocks. Create variants: centered, split-screen, with background image, gradient backgrounds, with form integration, minimal, and bold. Support: multiple button styles, optional subtitle, background patterns/shapes, icon support, and statistics/trust indicators. Make fully responsive with different mobile layouts. Add entrance animations and hover effects.",
        "status": "completed"
      },
      {
        "id": "timeline-block",
        "description": "Create new Timeline block component. Variants: vertical centered, vertical alternating, horizontal (desktop only), minimal dots, with images. Features: date/time stamps, icons for each event, connecting lines (solid/dashed), milestone markers, and content cards. Support both past/future events with different styling. Add scroll-triggered animations. Create both company history and roadmap examples.",
        "status": "completed"
      },
      {
        "id": "testimonial-block",
        "description": "Move Testimonial component to blocks. Create variants: single card, carousel, grid (2x2, 3x1), with video, minimal quote, and with ratings. Features: customer photos, company logos, job titles, star ratings, quote marks styling, and source links. Add navigation for carousel variant and auto-play option. Support long-form and short testimonials. Include social proof elements.",
        "status": "completed"
      },
      {
        "id": "carousel-block",
        "description": "Move Carousel to blocks directory. Enhance with variants: image gallery, content cards, testimonials, product showcase, and fullscreen. Features: dots/arrows navigation, thumbnails strip, auto-play with pause on hover, swipe support, infinite loop, and variable items per view. Add Ken Burns effect for images, lazy loading, and zoom on click. Create mobile-optimized touch interactions.",
        "status": "pending"
      },
      {
        "id": "faq-block",
        "description": "Create new FAQ block component. Variants: accordion style, grid cards, two-column, with categories, and with search. Features: expand/collapse animations, category filtering, search functionality, anchor links, and most helpful voting. Support rich content in answers (lists, links, code). Add 'Contact Support' CTA and related articles. Create smooth height transitions and mobile-optimized layouts.",
        "status": "pending"
      },
      {
        "id": "team-grid-block",
        "description": "Create Team Grid block. Variants: grid cards, list view, minimal circles, with hover bio, and department groups. Features: profile photos with fallback, name/role/bio, social links (LinkedIn, Twitter), department tags, and direct contact options. Add filter by department, search by name, and optional org chart view. Include hover effects and modal bio option.",
        "status": "pending"
      },
      {
        "id": "blog-post-grid-block",
        "description": "Create Blog Post Grid block. Variants: cards with image, minimal list, magazine style, with sidebar, and masonry. Features: featured image, category tags, read time, author info, excerpt, and publish date. Add pagination, category filtering, search, and sort options (date, popularity). Support featured/sticky posts, loading states, and infinite scroll option.",
        "status": "pending"
      },
      {
        "id": "blog-post-detail-block",
        "description": "Create Blog Post Detail block. Variants: centered article, with sidebar, magazine layout, and minimal. Features: hero image, table of contents, share buttons, author bio box, related posts, and comments section placeholder. Add reading progress bar, estimated read time, syntax highlighting for code blocks, and image lightbox. Include prev/next navigation.",
        "status": "pending"
      },
      {
        "id": "brand-logo-bar-block",
        "description": "Create Brand Logo Bar block for trust/social proof. Variants: scrolling marquee, static grid, with heading, grayscale with color on hover, and compact. Features: logo sizing options, spacing controls, optional 'Trusted by' heading, and link support. Add smooth infinite scroll animation, pause on hover, and mobile responsive layouts. Support both light/dark logos with automatic switching.",
        "status": "pending"
      },
      {
        "id": "service-list-block",
        "description": "Create Service List block. Variants: cards grid, list with icons, alternating image/text, tabs layout, and accordion. Features: service icon/image, title, description, feature lists, pricing info, and CTA buttons. Add hover effects, optional badges (Popular, New), and comparison mode. Support both product features and service offerings layouts.",
        "status": "pending"
      },
      {
        "id": "page-section-block",
        "description": "Create Page Section wrapper block for marketing pages. Variants: full-width, contained, split background, angled/curved edges, and with patterns. Features: background colors/gradients/images, padding options, optional heading, and content alignment. Add parallax scrolling option, intersection observer for animations, and divider shapes. This wraps other blocks to create cohesive page sections.",
        "status": "pending"
      },
      {
        "id": "contact-form-block",
        "description": "Create Contact Form block. Variants: simple contact, detailed inquiry, with map, split screen, and minimal. Features: form validation, field types (text, email, phone, textarea, select), optional fields, and file upload. Add reCAPTCHA support, success/error states, loading states, and thank you message. Include office info sidebar option with map integration.",
        "status": "pending"
      },
      {
        "id": "latest-news-block",
        "description": "Create Latest News/Articles block for homepages. Variants: featured + list, cards row, minimal links, with images, and magazine style. Features: article thumbnails, categories, dates, author, and excerpt. Add 'View All' link, optional newsletter signup, and loading skeleton. Support 3-6 articles display with responsive layouts. Include optional category tabs.",
        "status": "pending"
      },
      {
        "id": "newsletter-signup-block",
        "description": "Create Newsletter Signup block. Variants: inline form, modal popup, slide-in, footer bar, and with incentive. Features: email validation, name field option, GDPR checkbox, success confirmation, and loading states. Add integration points for email services, optional background images/patterns, and exit intent trigger option. Include privacy policy link and benefits list.",
        "status": "pending"
      }
    ]
  }
]